too1/nrf52-ble-pong-central/main.c
    ble_thingy_uis_on_db_disc_evt(&m_thingy_uis_c[p_evt->conn_handle], p_evt);
    ble_thingy_tms_on_db_disc_evt(&m_thingy_tms_c[p_evt->conn_handle], p_evt);
}


/** @brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/** @brief Function for initializing the log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/** @brief Function for initializing the timer.
 */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}

static void interface_update_timer_callback(void *p)
{
    for(int i = 0; i < 1; i++)
    {
        ble_thingy_uis_led_set_constant(&m_thingy_uis_c[i], 0, 255, 255);
        //ble_thingy_tms_c_raw_notif_enable(&m_thingy_tms_c[i]);
        

    }
}
#define UART_SCREEN_X 15
#define UART_SCREEN_Y 10
static void pong_draw_screen(pong_gamestate_t *gamestate)
{
    static divider = 0;
    if(++divider > 5)
    {
        divider = 0;
        uint8_t screen_matrix[UART_SCREEN_X + 2][10] = {0};
        uint32_t pong_screen_x = gamestate->pong_pos_x * UART_SCREEN_X / 1000;    
        uint32_t pong_screen_y = gamestate->pong_pos_y * UART_SCREEN_Y / 1000;
        
        // Set ball
        screen_matrix[pong_screen_x + 1][pong_screen_y] = 1;
        // Set left paddle
        screen_matrix[0][gamestate->player[0].paddle_pos_y * UART_SCREEN_Y / 101] = 1;
        // Set right paddle
        screen_matrix[UART_SCREEN_X + 1][gamestate->player[1].paddle_pos_y * UART_SCREEN_Y / 101] = 1;

        //printf("\r\n---------------------\r\n");
        for(int y = 0; y < UART_SCREEN_Y; y++)
        {
            bool pixels_present = false;
            for(int x = 0; x < (UART_SCREEN_X+2); x++)
            {
                if(screen_matrix[x][y] != 0)
                {
                    pixels_present = true;
                    break;
                }
            }
            if(pixels_present)
            {
              for(int x = 0; x < (UART_SCREEN_X+2); x++)
              {
                  screen_matrix[x][y] == 1 ? printf("X") : printf(" ");
              }
            }
            printf("\r\n");
               
        }
    }
}

static void app_pong_event_handler(pong_event_t *evt)
{
    switch(evt->evt_type)
    {
        case PONG_EVENT_GAMESTATE_UPDATE:
            pong_draw_screen(evt->game_state);
            //NRF_LOG_INFO("x: %i, y: %i", evt->game_state->pong_pos_x, evt->game_state->pong_pos_y);
            break;
            
        default:
            break;
    }
}

static void pong_init(void)
{
    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
        m_pong_control_state.player[i].paddle_x = 50;
    }
    pong_config_t config;
    config.event_handler = app_pong_event_handler;
    app_pong_init(&config);
}

void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

static void uart_init(void)
{
    uint32_t err_code;
     const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
#if defined (UART_PRESENT)
          UART_BAUDRATE_BAUDRATE_Baud460800
#else
          NRF_UARTE_BAUDRATE_115200
#endif
      };

    APP_UART_FIFO_INIT(&comm_params,
                         16,
                         128,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);   
}

int main(void)
{
    // Initialize.
    log_init();
    timer_init();
    leds_init();
    uart_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    db_discovery_init();
    thingy_c_init();
    ble_conn_state_init();

    // Start execution.
    NRF_LOG_INFO("Thingy Pong started.");
    scan_start();
    
    app_timer_create(&m_app_timer_interface_update, APP_TIMER_MODE_REPEATED, interface_update_timer_callback);
    app_timer_start(m_app_timer_interface_update, APP_TIMER_TICKS(5000), 0);
    
    pong_init();

    app_pong_start_game();
    
    for (;;)
    {
          idle_state_handle();
    }
}
